{
  "Descriptions": {
    "general": "Mastery of a competency is cumulative. At each successive level, engineers are expected to retain the skills and characteristics required at earlier levels.",
    "Delivery": "Scoping and prioritization, Testing and monitoring, Shipping to production, Initiative",
    "Domain Expertise": "Knowledge of your discipline (e.g. Payments, AppSec, Provisioning, Machine Learning), Language, Tools, Business and product sense",
    "Problem Solving": "Architecture & design patterns, Breaking down large problems, Critical thinking, Analytical skills, Creativity, Decision making",
    "Communication": "Documentation, Collaboration, Relationship-building, Interviewing, Listening, Empathy",
    "Leadership": "Accountability, Responsibility, Mentorship, Making hard decisions, Setting an example"
  },
  "Delivery": {
    "Beginner": [
      "You understand scope of work before taking on tasks.",
      "You test your work following relevant examples.",
      "You take ownership of your work after it's released and quickly address issues as they arise.",
      "You collect and incorporate feedback (such as code reviews) to ship your work.",
      "You follow your team's best practices to bring your work to production.",
      "You participate in your team's planning and are learning to estimate how long work will take."
    ],
    "Intermediate": [
      "You estimate accurate timelines for tasks and deliver work at a steady, predictable pace to hit your deadlines.",
      "You effectively use a variety of testing methods and monitoring tools to ensure the quality and production readiness of your work before and after release.",
      "You consider and build for many different use cases but avoid over engineering.",
      "You ship complete solutions, but release them in small, safe patches.",
      "You're a responsible user of our shared infrastructure, considering the effect your work has outside your team and ensuring you are not diminishing their delivery.",
      "You identify important tradeoffs and negotiate them, either independently or with your team."
    ],
    "Advanced": [
      "You collaboratively roadmap large tracks of work with reliable estimates of time, effort, and risk, and you help ensure your team can hit deadlines.",
      "You communicate with teammates, collaborators, and stakeholders, and you take responsibility for your plans, both when they're on track and when they aren't.",
      "You use an array of automated tests, analysis, and ad-hoc solutions to ensure the quality and production readiness of your work before release.",
      "You monitor the health of your work and that of adjacent systems to avoid surprises.",
      "You surface and understand how multiple large projects - worked on by you and others - intersect and ensure minimal friction in their release.",
      "You anticipate deviations from standard practicesand find practical ways to move forward."
    ],
    "Expert": [
      "You bring together the work of many teams and individuals into a cohesive, achievable plan that aligns with goals and deadlines.",
      "You devise, apply, and share novel and nuanced ways to ensure the quality, production readiness, and continued health of complex systems.",
      "You incorporate awareness and understanding of work happening outside your team to minimize surprises and make projects more likely to succeed.",
      "You work effectively at a variety of speeds: fast when risk is low and time is tight; more deliberately when a cautious and coordinated process is warranted.",
      "You develop widely used technical metrics that enable engineers to better understand and deliver their work."
    ],
    "Leading Expert": [
      "You remove widely-felt barriers to productivity, finding ways to make the entire engineering organization more effective at shipping products and infrastructure.",
      "You create tools to help engineers deliver, test, and monitor software that can be used across the industry.",
      "You work on the tasks that matter most, even if your capabilities far outweigh the challenge.",
      "You craft systems that continue to function and can be maintained without your continued involvement."
    ]
  },
  "Domain Expertise": {
    "Beginner": [
      "You ask questions to support your own continuous learning.",
      "You learn from your own research and from those around you.",
      "You seize opportunities to increase your knowledge."
    ],
    "Intermediate": [
      "You understand the technical concepts necessary to do your job effectively and are aware of industry trends in your domain.",
      "You have a good sense of where to find answers and are able to grow your own knowledge both with and without guidance.",
      "You're comfortable using the tools relevant to your domain, and your development environment enables you to be productive.",
      "You have in depth knowledge of immediate systems you work on and some knowledge of adjacent systems.",
      "You understand why your work is important to the business and your users, and how it relates to your team's goals."
    ],
    "Advanced": [
      "You use your specialized knowledge as well as your business and technical acumen to ensure that projects succeed.",
      "You know what tools are available and useful for your domain. You understand how they work, and the sorts of situations and problems for which they're useful. You use them effectively and teach them to your teammates.",
      "You have strong, well-founded opinions about how to build software in your domain, but you're adaptable and open to new ideas.",
      "You closely follow industry trends relevant to your domain and understand how to apply them to your work as appropriate.",
      "You share your knowledge with coworkers. You're able to explain topics about which you know a great deal to those who know less in a way that is understandable and not condescending."
    ],
    "Expert": [
      "You use your expertise to improve Etsy's capabilities in your domain.",
      "You actively share your knowledge and seek opportunities to teach others about your domain.",
      "You thoughtfully and practically introduce concepts and technologies from the industry to solve important problems.",
      "Work you have done or that is based on your expertise has consistently been successful. Your expertise helps projects and teams achieve and exceed their goals."
    ],
    "Leading Expert": [
      "Your contributions to the field (e.g. talks, open source projects, research papers) have meaningful impact beyond Etsy.",
      "Your expertise helps Etsy Engineering as a whole achieve and exceed its goals.",
      "You use your expertise to come up with solutions to long-standing or seemingly intractable problems.",
      "You contribute to the advancement of the wider industry in your domain."
    ]
  },
  "Problem Solving": {
    "Beginner": [
      "You're able to debug familiar code or systems easily, and you can debug unfamiliar code with some effort.",
      "You recognize when you don't yet have the experience or knowledge to solve a problem and reach out to other engineers for help or guidance.",
      "You are beginning to understand which tools are relevant to your work and how to use them.",
      "You prepare to work on new tasks by planning an approach ahead of time and confirming it's well thought out.",
      "You approach each new task as an opportunity to learn and continually apply what you've learned to each new challenge."
    ],
    "Intermediate": [
      "You utilize data, future roadmaps, customer research, and relevant engineering principles to inform the decisions you make, assuring your solutions are built for the long term.",
      "You optimize your workflow by recognizing and solving repetitive problems rather than working around them.",
      "You recognize your own mistakes, use them as a learning and teaching opportunity, and adjust your approach to minimize the risk of repeating the same type of mistake.",
      "You utilize new technologies, patterns, and the domain expertise of fellow engineers to supplement your own skills.",
      "You are learning to break down large problems into smaller, more manageable ones.",
      "You have strong debugging skills, allowing you to determine source of issues in unfamiliar code or systems."
    ],
    "Advanced": [
      "You are guided by your experience to identify and solve issues with ease even when they are not in your domain.",
      "Your technical planning has shown to reduce failure scenarios and identify edge cases early on.",
      "You utilize data and proofs of concept to find creative solutions to difficult problems.",
      "You reflect on solutions you have created, measure their impact, and use that information to ideate and optimize future work.",
      "You break down complex problems into smaller, more manageable ones, and help others to do the same",
      "You are adept at making decisions that involve a significant number of factors and have broad implications."
    ],
    "Expert": [
      "You utilize your debugging skills to solve pressing issues in areas of the codebase you are unfamiliar with and are capable of providing useful on-call support across a broad range of issues.",
      "Your solutions are consistently successful across multiple dimensions, including performance, scalability, robustness and maintainability.",
      "You create architecture that does not rely on you personally, and is particularly robust against single points of failure, both in terms of systems and people.",
      "Your architectural proposals are informed by industry literature and you are able to develop enough domain expertise in the problem space to understand technological tradeoffs at a sufficiently deep level.",
      "You are able to look ahead 6-12 months to identify areas of greatest need for a particular large system or project, and turn this into a roadmap with actionable milestones."
    ],
    "Leading Expert": [
      "You create architecture that gets near-unanimous acceptance and adoption from critical stakeholders, and which provides continual benefit with little support or overhead for a very long lifespan.",
      "You identify barriers that are slowing down teams and initiatives at Etsy and create practical technical solutions to increase efficiency.",
      "You are a leader who provides actionable direction to teams in the face of complex problems involving multiple stakeholders.",
      "You create new technologies that solve industry-wide problems."
    ]
  },
  "Communication": {
    "Beginner": [
      "You are able to clearly articulate questions.",
      "You are learning to collaborate with team members in various roles (e.g. other engineers, PMs, designers)",
      "You understand and follow Etsy's charter of mindful communications.",
      "You know when to keep digging and when to ask for help. You know when you are stuck and need to be unblocked.",
      "When you learn something new, or figure out the solution to a problem, you write documentation that helps others when they encounter similar issues."
    ],
    "Intermediate": [
      "You regularly write documentation related to your work that is clear and easy to follow.",
      "You collaborate well with team members as both a mentor and a mentee.",
      "You are able to take in vague requirements and ask the right questions to ensure they are clarified.",
      "You have a sense for when and how to appropriately and effectively offer feedback.",
      "You seek out and receive constructive criticism well and do not express territorialism over your work.",
      "You listen when others are speaking and make space for your colleagues to share their thoughts.",
      "You actively participate in interviewing and provide thoughtful feedback."
    ],
    "Advanced": [
      "Your written communication is concise and clear. You document not only the narrow projects you are working on but also larger initiatives, and you make sure the right people have the right context.",
      "You collaborate effectively with your teammates and with others outside your team, with engineers and with people in other roles (e.g. PMs, designers, managers). You encourage collaboration among others.",
      "You quickly extract core issues from discussions and meetings. Your presence makes meetings more productive.",
      "You are adept at giving and receiving constructive feedback and you both give and receive feedback clearly and with empathy.",
      "You explain technical concepts clearly and with patience, and adjust your communication based on the audience. You offer help when asked, but you also know when to step back and let others work things out on their own.",
      "You're an attentive and empathetic listener. You ensure that everyone you're working with gets a chance to share their thoughts and that they're heard."
    ],
    "Expert": [
      "You make yourself accountable for the documentation of very large projects, and are able to coordinate with others to ensure documentation gets written.",
      "Your documentation ensures that systems/architectures can be maintained or built upon by people who were not originally involved in building them.",
      "You help disparate groups of people collaborate, identify common goals, and reach consensus. Your facilitation skills keep conversations productive and respectful.",
      "Others turn to you for help giving difficult feedback. Others often seek out your advice on matters involving communication.",
      "You adapt your language to meet the needs of various levels of technical and non-technical audiences. Others seek you out because you're approachable, respectful, and they know they will learn from you.",
      "You not only practice mindful communication and active listening in your interactions but encourage these practices in others."
    ],
    "Leading Expert": [
      "You've made significant changes to how Etsy handles documentation, facilitation, or collaboration that has improved the functioning of the Engineering organization.",
      "You create spaces and channels that improve cross-team and inter-departmental communication.",
      "Others often turn to you to make and communicate difficult decisions.",
      "Your presence and example has a strong, positive influence on Etsy's working environment."
    ]
  },
  "Leadership": {
    "Beginner": [
      "You accept direction and guidance and are learning what traits are valuable in a leader.",
      "You are transparent about what you do not understand and need help with, and communicate this to the appropriate parties (e.g. your manager).",
      "You seek feedback often with an eye towards improving."
    ],
    "Intermediate": [
      "You identify problems and propose solutions to them.",
      "You are self-motivated in tackling your team's projects.",
      "You seek feedback often and take actionable steps to respond to the feedback.",
      "You help create a safe environment for others to learn and grow as engineers.",
      "You take on small roles that involve direct leadership (being a mentor, running a working group/ERG/etc)."
    ],
    "Advanced": [
      "You take action when there is a problem without a clear owner, and you don't shy away from being the accountable party.",
      "You inspire and motivate others to tackle projects.",
      "You are generous with your time and foster an environment where people feel comfortable asking questions.",
      "You are decisive, and your good business sense and technical depth are an asset to the decision making process.",
      "You turn ideas and opportunities into meaningful tracks of work that can be picked up by your teammates or other teams.",
      "You often take on roles involving direct leadership (for example, coordinating a long-term project or initiative)."
    ],
    "Expert": [
      "You have successfully changed how Etsy engineering functions to meet a critical need.",
      "You have a large internal network across engineering and engage with other leaders to solve problems (technical, organizational, or social). You have developed strong credibility throughout the company.",
      "You choose the most critical engineering challenges in your path and establish yourself as a primary accountable party for Etsy's success in meeting these challenges.",
      "You improve the entire engineering organization by teaching others and sharing your knowledge. You create opportunities for others to showcase and develop their skills."
    ],
    "Leading Expert": [
      "You have successfully changed how Etsy engineering functions in a way that has moved both Etsy forward and established a best practice in the engineering industry.",
      "You are accountable for the success of Etsy engineering with respect to attracting engineers and ensuring the strength of our engineering brand.",
      "You regularly represent Etsy engineering publicly, e.g. via blog posts, giving talks.",
      "Your technical leadership is cited by many on the engineering team as a significantly positive aspect of working at Etsy.",
      "You make hard decisions in the face of uncertainty."
    ]
  }
}
